{
  "Metadata": {
    "title": "Clément Chardine",
    "description": "¡Ese soy yo!"
  },
  "About": {
    "code": "En mis primeros días, comencé a explorar el desarrollo creando pequeños proyectos y rápidamente me cautivaron las posibilidades infinitas de la programación. A lo largo de los años, he tenido el privilegio de trabajar como ingeniero de software y, eventualmente, cofundé <sniivelink>Sniive</sniivelink>, donde fui CTO, desarrollando soluciones para optimizar la transferencia de conocimientos en equipos. Anteriormente, trabajé en proyectos innovadores en lugares como <cedelink>CEDE Labs</cedelink> y <wanderlink>Wandercraft</wanderlink>, siempre con el objetivo de construir software que combine funcionalidad robusta con un diseño intuitivo.",
    "other": "Hoy en día, me enfoco en diseñar arquitecturas elegantes que mejoren la experiencia del usuario mientras soportan aplicaciones complejas basadas en datos. Cuando no estoy inmerso en el código, estoy haciendo o escuchando <spotilink>música</spotilink>, refinando mis playlists o explorando las últimas tendencias en tecnología e inteligencia artificial."
  },
  "Identity": {
    "title": "Ingeniero de Software",
    "location": "París, Francia",
    "subtitle": "Soy un ingeniero de software con pasión por la arquitectura de software y las ideas innovadoras"
  },
  "TopNav": {
    "portfolio": "Portfolio",
    "lab": "Lab"
  },
  "Lab": {
    "title": "Lab",
    "description": "Una colección de cosas interesantes que he encontrado y experimentos que he realizado"
  },
  "Navbar": {
    "about": "Sobre mí",
    "experience": "Experiencia",
    "education": "Educación"
  },
  "Experiences": {
    "eledone": {
      "name": "Tech Lead",
      "time": {
        "begin": "2024-11"
      },
      "children": "Liderando el desarrollo técnico en Eledone, una startup impulsada por IA que automatiza la administración de ventas B2B mediante el procesamiento inteligente de cotizaciones y pedidos. Construyendo una plataforma sólida que se conecta con los principales sistemas ERP y aprovecha modelos avanzados de IA para el procesamiento de documentos.<h>Aspectos técnicos destacados:</h><u><l>Desarrollo backend con Python y Django para canalizaciones centrales de procesamiento de IA</l><l>Desarrollo frontend con Next.js y TypeScript para interfaces de usuario intuitivas</l><l>Infraestructura en la nube sobre Google Cloud Platform (GCP)</l><l>Integración con múltiples sistemas ERP y automatización del procesamiento de correos electrónicos</l><l>Optimización de modelos de IA/ML para extracción de documentos y coincidencia de datos</l></u><h>Aspectos comerciales destacados:</h><u><l>Apoyado por CentraleSupélec, HEC Paris, Station F y Wilco</l><l>Atendiendo a docenas de clientes B2B con procesamiento automatizado de pedidos y cotizaciones</l><l>Solución plug & play compatible con todos los principales sistemas ERP</l></u>"
    },
    "sniive": {
      "name": "Cofundador y CTO",
      "time": {
        "begin": "2024-04",
        "end": "2024-11"
      },
      "children": "Experiencia en emprendimiento, enfocado en crear una plataforma SaaS para documentar rápidamente procesos empresariales. Lideré el desarrollo del producto desde cero, cubriendo todos los aspectos, incluyendo frontend, backend y servicios en la nube.<h>Aspectos técnicos destacados:</h><u><l>Uso extensivo de GenAI (LLMs multimodales) y tecnologías de Visión por IA</l><l>Desarrollo full-stack para una aplicación web alojada en Vercel</l><l>Gestión de infraestructura en la nube en Azure, enfocada en arquitectura serverless y microservicios</l><l>Desarrollo de aplicaciones de escritorio multiplataforma con Rust y Tauri</l></u><h>Aspectos comerciales destacados:</h><u><l>Enfoque en B2B, con más de 2K$ asegurados en pre-ventas</l><l>Desarrollo iterativo con enfoque en la retroalimentación de clientes</l><l>Incubado en STATION F, el campus de startups más grande del mundo</l><l>Apoyado por CentraleSupélec y destacados empresarios franceses</l></u>"
    },
    "cede": {
      "name": "Desarrollador Fullstack",
      "time": {
        "begin": "2023-03",
        "end": "2024-08"
      },
      "children": "Trabajé en el desarrollo de una plataforma SaaS y una extensión para Chrome para la gestión de activos digitales, tanto en redes centralizadas como descentralizadas.<h>Principales responsabilidades:</h><u><l>Refactorización profunda de la lógica de negocio de la extensión para mejorar el rendimiento y optimizar la experiencia del desarrollador</l><l>Creación de una API para la plataforma, empaquetada como un SDK para desarrolladores externos</l><l>Proyecto de I+D en una aplicación móvil nativa para la plataforma</l></u>"
    },
    "wandercraft": {
      "name": "Desarrollador de Software",
      "time": {
        "begin": "2022-09",
        "end": "2023-02"
      },
      "children": "Desarrollé una herramienta para monitorear y diagnosticar problemas con el exoesqueleto. La aplicación era utilizada por equipos de mantenimiento e ingenieros, tanto para soporte remoto como en sitio.<s></s>La herramienta utilizaba el protocolo EtherCAT para comunicarse con el exoesqueleto y se enfocaba en obtener información de un sistema complejo y potencialmente defectuoso."
    }
  },
  "Educations": {
    "centralesupelec": {
      "name": "Maestría en Ingeniería",
      "time": {
        "begin": "2020-09",
        "end": "2024-04"
      },
      "children": "Graduado con especialización en Arquitectura y Desarrollo de Software en CentraleSupélec (una de las dos mejores escuelas de ingeniería en Francia).<s></s>Curso adicional en Emprendimiento durante el último año.<h>Cursos principales:</h><u><l>Ingeniería de Software y Algoritmos</l><l>Infraestructuras de Sistemas y Redes</l><l>Arquitecturas Aplicativas</l><l>Economía y Gestión de TI</l><l>Transformación Estratégica de TI</l></u><h>Otros cursos:</h><u><l>Diseño</l><l>Economía</l><l>Ingeniería de Datos</l><l>Matemáticas y Estadísticas</l><l>Electrónica y Física</l></u>"
    },
    "kaist": {
      "name": "Semestre en el Extranjero",
      "time": {
        "begin": "2022-01",
        "end": "2022-07"
      },
      "children": "Un semestre en el extranjero en 한국과학기술원 🇰🇷 (la universidad número 1 de Corea del Sur) en el Departamento de Ingeniería Mecánica.<h>Cursos:</h><u><l>Aprendizaje Automático para Robótica</l><l>Teoría de la Codificación</l><l>Dinámica de Robots</l><l>Metodología Lean Startup</l></u>"
    },
    "sorbonne": {
      "name": "Licenciatura en Filosofía",
      "time": {
        "begin": "2020-09",
        "end": "2021-06"
      },
      "children": "Cursé estudios de tercer año en filosofía en la Universidad de la Sorbona (París IV) durante el primer año de mis estudios de ingeniería.<h>Tópicos:</h><u><l>Lógica</l><l>Ética</l><l>Filosofía Política</l><l>Metafísica</l><l>Filosofía del Lenguaje</l><l>Filosofía India</l></u>"
    },
    "prepa": {
      "name": "Clases Preparatorias",
      "time": {
        "begin": "2018-09",
        "end": "2020-06"
      },
      "children": "Clases preparatorias en Matemáticas, Física y Ciencias de la Ingeniería (MPSI/MP*) en el Lycée Pierre Corneille en Rouen"
    }
  }
}
